package org.mocraft.Nagato.Gui;

import org.mocraft.Nagato.Levy;

public class LevyData {

	@Deprecated
	public final static int time[] = {
			0,
			900,	1800,	1200,	3000,	5400,	2400,	3600,	10800,
			14400,	5400,	18000,	28800,	14400,	21600,	43200,	54000,
			2700,	18000,	21600,	7200,	8400,	10800,	14400,	30000,
			144000,	288000,	72000,	90000,	86400,	172800,	7200,	86400,
			900,	1800,	25200,	32400,	9900,	10500,	10800,	24600
			
	};
	public final static String name[] = {
			"", 
			"01練習航海",		"02長距離練習航海",	"03警備任務",			"04対潜警戒任務",	"05海上護衛任務",	"06防空射撃演習",		"07観艦式予行",			"08観艦式",
			"09タンカー護衛任務",	"10強行偵察任務",	"11ボーキサイト輸送任務",	"12資源輸送任務",	"13鼠輸送作戦",		"14包囲陸戦隊撤収作戦",	"15囮機動部隊支援作戦",	"16艦隊決戦援護作戦",
			"17敵地偵察作戦",	"18航空機輸送作戦",	"19北号作戦",			"20潜水艦哨戒任務",	"21北方鼠輸送作戦",	"22艦隊演習",			"23航空戦艦運用演習",		"24北方航路海上護衛",
			"25通商破壊作戦",	"26敵母港空襲作戦",	"27潜水艦通商破壊作戦",	"28西方海域封鎖作戦",	"29潜水艦派遣演習",	"30潜水艦派遣作戦",		"31海外艦との接触",		"32遠洋練習航海",
			"33前衛支援任務",	"34艦隊決戦支援任務",	"35MO作戦",			"36水上機基地建設",	"37東京急行",		"38東京急行(弐)",		"39遠洋潜水艦作戦",		"40水上機前線輸送"
	};
	
	public final static Levy levys[] = {
			new Levy("", 0, new int[] {0, 0, 0, 0}),
			new Levy("01 練習航海", 900, new int[] {0, 30, 0, 0}),
			new Levy("02 長距離練習航海", 1800, new int[] {0, 100, 30, 0}),
			new Levy("03 警備任務", 1200, new int[] {30, 30, 40, 0}),
			new Levy("04 対潜警戒任務", 3000, new int[] {0, 60, 0, 0}),
			new Levy("05 海上護衛任務", 5400, new int[] {200, 200, 20, 20}),
			new Levy("06 防空射撃演習", 2400, new int[] {0, 0, 0, 80}),
			new Levy("07 観艦式予行", 3600, new int[] {0, 0, 50, 30}),
			new Levy("08 観艦式", 10800, new int[] {50, 100, 50, 50}),
			
			new Levy("09 タンカー護衛任務", 14400, new int[] {350, 0, 0, 0}),
			new Levy("10 強行偵察任務", 5400, new int[] {0, 50, 0, 30}),
			new Levy("11 ボーキサイト輸送任務", 18000, new int[] {0, 0, 0, 250}),
			new Levy("12 資源輸送任務", 28800, new int[] {50, 250, 200, 50}),
			new Levy("13 鼠輸送作戦", 14400, new int[] {240, 300, 0, 0}),
			new Levy("14 包囲陸戦隊撤収作戦", 21600, new int[] {0, 240, 200, 0}),
			new Levy("15 囮機動部隊支援作戦", 43200, new int[] {0, 0, 300, 400}),
			new Levy("16 艦隊決戦援護作戦", 54000, new int[] {500, 500, 200, 200}),
			
			new Levy("17 敵地偵察作戦", 2700, new int[] {70, 70, 50, 0}),
			new Levy("18 航空機輸送作戦", 18000, new int[] {0, 0, 300, 100}),
			new Levy("19 北号作戦", 21600, new int[] {400, 0, 50, 30}),
			new Levy("20 潜水艦哨戒任務", 7200, new int[] {0, 0, 150, 0}),
			new Levy("21 北方鼠輸送作戦", 8400, new int[] {320, 270, 0, 0}),
			new Levy("22 艦隊演習", 10800, new int[] {0, 10, 0, 0}),
			new Levy("23 航空戦艦運用演習", 14400, new int[] {0, 20, 0, 100}),
			new Levy("24 北方航路海上護衛", 30000, new int[] {500, 0, 0, 150}),
			
			new Levy("25 通商破壊作戦", 144000, new int[] {900, 0, 500, 0}),
			new Levy("26 敵母港空襲作戦", 288000, new int[] {0, 0, 0, 900}),
			new Levy("27 潜水艦通商破壊作戦", 72000, new int[] {0, 800, 0, 0}),
			new Levy("28 西方海域封鎖作戦", 90000, new int[] {0, 0, 900, 350}),
			new Levy("29 潜水艦派遣演習", 86400, new int[] {0, 0, 0, 100}),
			new Levy("30 潜水艦派遣作戦", 172800, new int[] {0, 0, 0, 100}),
			new Levy("31 海外艦との接触", 7200, new int[] {0, 30, 0, 0}),
			new Levy("32 遠洋練習航海", 86400, new int[] {50, 50, 50, 50}),
			
			new Levy("33 前衛支援任務", 900, new int[] {0, 0, 0, 0}),
			new Levy("34 艦隊決戦支援任務", 1800, new int[] {0, 0, 0, 0}),
			new Levy("35 MO作戦", 25200, new int[] {0, 0, 240, 280}),
			new Levy("36 水上機基地建設", 32400, new int[] {480, 0, 200, 200}),
			new Levy("37 東京急行", 9900, new int[] {0, 380, 270, 0}),
			new Levy("38 東京急行(弐)", 10500, new int[] {420, 0, 200, 0}),
			new Levy("39 遠洋潜水艦作戦", 10800, new int[] {0, 0, 300, 0}),
			new Levy("40 水上機前線輸送", 24600, new int[] {300, 300, 0, 100})
	};
}
