package org.mocraft.Nagato.Gui;

public class LevyData {

	public static int time[] = {
			0,
			900,	1800,	1200,	3000,	5400,	2400,	3600,	10800,
			14400,	5400,	18000,	28800,	14400,	21600,	43200,	54000,
			2700,	18000,	21600,	7200,	8400,	10800,	14400,	30000,
			144000,	288000,	72000,	90000,	86400,	172800,	7200,	86400,
			900,	1800,	25200,	32400,	9900,	10500,	10800,	24600
			
	};
	public static String name[] = {
			"", 
			"01練習航海",		"02長距離練習航海",	"03警備任務",			"04対潜警戒任務",	"05海上護衛任務",	"06防空射撃演習",		"07観艦式予行",			"08観艦式",
			"09タンカー護衛任務",	"10強行偵察任務",	"11ボーキサイト輸送任務",	"12資源輸送任務",	"13鼠輸送作戦",		"14包囲陸戦隊撤収作戦",	"15囮機動部隊支援作戦",	"16艦隊決戦援護作戦",
			"17敵地偵察作戦",	"18航空機輸送作戦",	"19北号作戦",			"20潜水艦哨戒任務",	"21北方鼠輸送作戦",	"22艦隊演習",			"23航空戦艦運用演習",		"24北方航路海上護衛",
			"25通商破壊作戦",	"26敵母港空襲作戦",	"27潜水艦通商破壊作戦",	"28西方海域封鎖作戦",	"29潜水艦派遣演習",	"30潜水艦派遣作戦",		"31海外艦との接触",		"32遠洋練習航海",
			"33前衛支援任務",	"34艦隊決戦支援任務",	"35MO作戦",			"36水上機基地建設",	"37東京急行",		"38東京急行(弐)",		"39遠洋潜水艦作戦",		"40水上機前線輸送"
	};
	
	public static String getImg(int i) {
		return ("img/Attack/Levy/" + i + ".png");
	}
	
}
